Repository: mrballistic/RaidCalculator2
Catalog: RaidCalculator2/Localizable.xcstrings
Source language: en
Languages: de, es, fr, it, ja, ko, pt_br, zh_hans, zh_hant

# zfs_calculation
source: Each drive counts only up to the size of the smallest; the rest is shown as unused. Usable space is shown two ways. The first is drives minus parity, times the smallest drive. The second estimates what ZFS will report for default settings (4K sectors and 128K records): it subtracts RAID-Z allocation padding and the space ZFS holds back, 1/32 of the pool, at most 128 GiB. Compression, record size and sector size change the real number.
de: Jedes Laufwerk zählt nur bis zur Größe des kleinsten; der Rest wird als ungenutzt angezeigt. Der nutzbare Speicher wird auf zwei Arten angezeigt. Der erste Wert ist Laufwerke minus Parität, mal die Größe des kleinsten Laufwerks. Der zweite ist eine Schätzung dessen, was ZFS mit den Standardeinstellungen (4K-Sektoren und 128K-Records) anzeigt: Abgezogen werden das RAID-Z-Allocation-Padding und der Platz, den ZFS zurückhält, 1/32 des Pools, höchstens 128 GiB. Komprimierung, Record-Größe und Sektorgröße verändern den tatsächlichen Wert.
es: Cada unidad solo cuenta hasta el tamaño de la más pequeña; el resto se muestra sin usar. El espacio utilizable se muestra de dos formas. La primera es el número de unidades menos la paridad, multiplicado por el tamaño de la unidad más pequeña. La segunda estima lo que ZFS mostrará con la configuración predeterminada (sectores de 4K y registros de 128K): resta el relleno de asignación de RAID-Z y el espacio que ZFS reserva, 1/32 del pool, como máximo 128 GiB. La compresión, el tamaño de registro y el tamaño de sector cambian la cifra real.
fr: Chaque disque ne compte que jusqu’à la taille du plus petit ; le reste est indiqué comme inutilisé. L’espace utilisable est indiqué de deux façons. Le premier chiffre correspond aux disques moins la parité, multipliés par la taille du plus petit disque. Le second estime ce que ZFS affichera avec les réglages par défaut (secteurs de 4K et enregistrements de 128K) : il déduit le remplissage d’allocation de RAID-Z et l’espace que ZFS réserve, soit 1/32 du pool, 128 GiB au maximum. La compression, la taille d’enregistrement et la taille de secteur modifient le chiffre réel.
it: Ogni disco conta solo fino alla dimensione del più piccolo; il resto è indicato come inutilizzato. Lo spazio utilizzabile è indicato in due modi. Il primo valore è il numero di dischi meno la parità, moltiplicato per la dimensione del disco più piccolo. Il secondo stima ciò che ZFS mostrerà con le impostazioni predefinite (settori da 4K e record da 128K): sottrae il padding di allocazione di RAID-Z e lo spazio che ZFS tiene da parte, 1/32 del pool, al massimo 128 GiB. Compressione, dimensione dei record e dimensione dei settori cambiano il valore reale.
ja: 各ドライブは最も小さいドライブの容量までしか使われず、残りは未使用として表示されます。使用可能容量は2通りで表示されます。1つ目は、ドライブ数からパリティを引き、最も小さいドライブの容量を掛けた値です。2つ目は、デフォルト設定（4Kセクター、128Kレコード）でZFSが表示する容量の見積もりで、RAID-Zの割り当てパディングと、ZFSが確保する予約領域（プールの1/32、最大128 GiB）を差し引いています。圧縮、レコードサイズ、セクターサイズによって実際の値は変わります。
ko: 각 드라이브는 가장 작은 드라이브의 크기까지만 계산되며, 나머지는 미사용으로 표시됩니다. 사용 가능한 공간은 두 가지 방식으로 표시됩니다. 첫 번째는 드라이브 수에서 패리티를 뺀 값에 가장 작은 드라이브의 크기를 곱한 값입니다. 두 번째는 기본 설정(4K 섹터, 128K 레코드)에서 ZFS가 표시할 용량의 추정치로, RAID-Z 할당 패딩과 ZFS가 예약하는 공간(풀의 1/32, 최대 128 GiB)을 뺍니다. 압축, 레코드 크기, 섹터 크기에 따라 실제 수치는 달라집니다.
pt_br: Cada unidade só conta até o tamanho da menor; o restante aparece como sem uso. O espaço utilizável é mostrado de duas formas. A primeira é o número de unidades menos a paridade, vezes o tamanho da menor unidade. A segunda é uma estimativa do que o ZFS vai informar com as configurações padrão (setores de 4K e registros de 128K): ela subtrai o preenchimento de alocação do RAID-Z e o espaço que o ZFS reserva, 1/32 do pool, no máximo 128 GiB. A compressão, o tamanho de registro e o tamanho de setor alteram o número real.
zh_hans: 每块硬盘只按最小硬盘的容量计算，其余部分显示为未使用。可用空间以两种方式显示。第一个数值为硬盘数减去校验盘数，再乘以最小硬盘的容量。第二个数值估算 ZFS 在默认设置（4K 扇区和 128K 记录）下显示的容量：它扣除了 RAID-Z 分配填充，以及 ZFS 预留的空间（存储池的 1/32，最多 128 GiB）。压缩、记录大小和扇区大小会改变实际数值。
zh_hant: 每顆硬碟只計入到最小硬碟的容量為止，其餘部分顯示為未使用。可用空間以兩種方式顯示。第一個是硬碟數減去同位元，再乘以最小硬碟的容量。第二個是在預設設定（4K 磁區與 128K 記錄）下，ZFS 會顯示的容量估計值：它扣除了 RAID-Z 的配置填補，以及 ZFS 保留的空間（儲存池的 1/32，最多 128 GiB）。壓縮、記錄大小與磁區大小都會改變實際數字。

# zfs_cons
source: Every drive counts only up to the size of the smallest drive Growing a group means replacing every drive, or OpenZFS 2.3 or later to add one drive at a time Uses more memory than other systems
de: Jedes Laufwerk zählt nur bis zur Größe des kleinsten Laufwerks Eine Gruppe zu vergrößern heißt, jedes Laufwerk zu ersetzen, oder ab OpenZFS 2.3 einzeln Laufwerke hinzuzufügen Braucht mehr Arbeitsspeicher als andere Systeme
es: Cada unidad solo cuenta hasta el tamaño de la unidad más pequeña Ampliar un grupo implica reemplazar todas las unidades, o usar OpenZFS 2.3 o posterior para añadirlas de una en una Usa más memoria que otros sistemas
fr: Chaque disque ne compte que jusqu’à la taille du plus petit disque Agrandir un groupe implique de remplacer tous les disques, ou d’utiliser OpenZFS 2.3 ou ultérieur pour ajouter un disque à la fois Utilise plus de mémoire que les autres systèmes
it: Ogni disco conta solo fino alla dimensione del disco più piccolo Per espandere un gruppo bisogna sostituire tutti i dischi, oppure usare OpenZFS 2.3 o successivo per aggiungere un disco alla volta Usa più memoria di altri sistemi
ja: 各ドライブは最も小さいドライブの容量までしか使われない グループの拡張にはすべてのドライブの交換が必要（OpenZFS 2.3以降ならドライブを1台ずつ追加可能） 他のシステムより多くのメモリを使う
ko: 모든 드라이브가 가장 작은 드라이브의 크기까지만 계산됨 그룹을 확장하려면 모든 드라이브를 교체해야 함(OpenZFS 2.3 이상에서는 드라이브를 하나씩 추가 가능) 다른 시스템보다 메모리를 많이 사용
pt_br: Cada unidade só conta até o tamanho da menor unidade Aumentar um grupo exige substituir todas as unidades, ou usar o OpenZFS 2.3 ou posterior para adicionar uma unidade de cada vez Usa mais memória que outros sistemas
zh_hans: 每块硬盘只按最小硬盘的容量计算 扩展组需要更换所有硬盘，或使用 OpenZFS 2.3 及更高版本每次添加一块硬盘 比其他系统占用更多内存
zh_hant: 每顆硬碟只計入到最小硬碟的容量為止 擴充群組需要更換所有硬碟，或使用 OpenZFS 2.3 以上版本一次加入一顆硬碟 比其他系統使用更多記憶體

# zfs_description
source: This models one ZFS RAID-Z group (vdev) built from the drives in these bays. RAID-Z1, Z2 and Z3 keep one, two or three drives’ worth of parity, and that many drives can fail without losing data.
de: Hier wird eine ZFS-RAID-Z-Gruppe (vdev) aus den Laufwerken in diesen Schächten berechnet. RAID-Z1, Z2 und Z3 halten ein, zwei oder drei Laufwerke an Parität vor, und genauso viele Laufwerke dürfen ohne Datenverlust ausfallen.
es: Aquí se modela un grupo RAID-Z de ZFS (vdev) formado por las unidades de estas bahías. RAID-Z1, Z2 y Z3 reservan el equivalente a una, dos o tres unidades para paridad, y pueden fallar ese mismo número de unidades sin perder datos.
fr: Ceci modélise un groupe RAID-Z de ZFS (vdev) constitué des disques de ces baies. Les RAID-Z1, Z2 et Z3 consacrent l’équivalent d’un, deux ou trois disques à la parité, et autant de disques peuvent tomber en panne sans perte de données.
it: Qui viene modellato un gruppo RAID-Z di ZFS (vdev) composto dai dischi di questi alloggiamenti. RAID-Z1, Z2 e Z3 riservano l’equivalente di uno, due o tre dischi alla parità, e altrettanti dischi possono guastarsi senza perdita di dati.
ja: ここでは、これらのベイのドライブで構成したZFSのRAID-Zグループ（vdev）を1つモデル化しています。RAID-Z1、Z2、Z3はそれぞれドライブ1台分、2台分、3台分のパリティを持ち、その台数までのドライブが故障してもデータを失いません。
ko: 여기서는 이 베이의 드라이브로 구성한 ZFS RAID-Z 그룹(vdev) 하나를 모델링합니다. RAID-Z1, Z2, Z3은 각각 드라이브 1개, 2개, 3개 분량의 패리티를 유지하며, 그 수만큼의 드라이브에 장애가 발생해도 데이터가 손실되지 않습니다.
pt_br: Aqui é modelado um grupo RAID-Z do ZFS (vdev) formado pelas unidades destas baias. O RAID-Z1, o Z2 e o Z3 reservam o equivalente a uma, duas ou três unidades para paridade, e esse mesmo número de unidades pode falhar sem perda de dados.
zh_hans: 这里将这些盘位中的硬盘建模为一个 ZFS RAID-Z 组（vdev）。RAID-Z1、Z2 和 Z3 分别保留一块、两块或三块硬盘容量的校验数据，相应数量的硬盘故障也不会丢失数据。
zh_hant: 這裡模擬以這些硬碟槽中的硬碟組成一個 ZFS RAID-Z 群組（vdev）。RAID-Z1、Z2 和 Z3 分別保留相當於一顆、兩顆或三顆硬碟的同位元，可承受相同顆數的硬碟故障而不遺失資料。

# zfs_estimate_hint
source: Estimated for default ZFS settings. Compression, record size and sector size change the real number.
de: Schätzung für die ZFS-Standardeinstellungen. Komprimierung, Record-Größe und Sektorgröße verändern den tatsächlichen Wert.
es: Estimación con la configuración predeterminada de ZFS. La compresión, el tamaño de registro y el tamaño de sector cambian la cifra real.
fr: Estimation pour les réglages par défaut de ZFS. La compression, la taille d’enregistrement et la taille de secteur modifient le chiffre réel.
it: Stima con le impostazioni predefinite di ZFS. Compressione, dimensione dei record e dimensione dei settori cambiano il valore reale.
ja: ZFSのデフォルト設定での見積もりです。圧縮、レコードサイズ、セクターサイズによって実際の値は変わります。
ko: 기본 ZFS 설정 기준 추정치입니다. 압축, 레코드 크기, 섹터 크기에 따라 실제 수치는 달라집니다.
pt_br: Estimativa para as configurações padrão do ZFS. A compressão, o tamanho de registro e o tamanho de setor alteram o número real.
zh_hans: 按 ZFS 默认设置估算。压缩、记录大小和扇区大小会改变实际数值。
zh_hant: 此為 ZFS 預設設定下的估計值。壓縮、記錄大小與磁區大小都會改變實際數字。

# zfs_not_affiliated
source: ZFS is a trademark of Oracle and/or its affiliates. Not affiliated with or endorsed by Oracle.
de: ZFS ist eine Marke von Oracle und/oder seinen verbundenen Unternehmen. Steht in keiner Verbindung zu Oracle und wird von Oracle weder unterstützt noch empfohlen.
es: ZFS es una marca comercial de Oracle y/o sus filiales. Sin afiliación ni respaldo de Oracle.
fr: ZFS est une marque d’Oracle et/ou de ses filiales. Non affilié à Oracle ni approuvé par elle.
it: ZFS è un marchio di Oracle e/o delle sue affiliate. Non affiliato né approvato da Oracle.
ja: ZFSはOracleおよびその関連会社の商標です。Oracleとは提携しておらず、同社の承認も受けていません。
ko: ZFS는 Oracle 및/또는 그 계열사의 상표입니다. Oracle과 제휴 관계가 없으며 Oracle의 승인을 받지 않았습니다.
pt_br: ZFS é uma marca comercial da Oracle e/ou de suas afiliadas. Não afiliado à Oracle nem endossado por ela.
zh_hans: ZFS 是 Oracle 和/或其关联公司的商标。本 App 与 Oracle 无关联，亦未获其认可。
zh_hant: ZFS 是 Oracle 及／或其關係企業的商標。本 App 與 Oracle 無任何關係，亦未獲其認可。

# zfs_padding_note
source: This group width loses about %@ more to RAID‑Z padding.
de: Diese Gruppenbreite verliert durch RAID‑Z-Padding etwa %@ zusätzlich.
es: Con este ancho de grupo se pierde aproximadamente un %@ más por el relleno de RAID‑Z.
fr: Cette largeur de groupe perd environ %@ de plus à cause du remplissage RAID‑Z.
it: Con questa larghezza del gruppo si perde circa un altro %@ per il padding di RAID‑Z.
ja: このグループ幅では、RAID‑Zのパディングによりさらに約%@が失われます。
ko: 이 그룹 폭에서는 RAID‑Z 패딩으로 인해 약 %@만큼 더 손실됩니다.
pt_br: Esta largura de grupo perde cerca de %@ a mais com o preenchimento do RAID‑Z.
zh_hans: 此组宽度会因 RAID‑Z 填充额外损失约 %@。
zh_hant: 此群組寬度因 RAID‑Z 填補而額外損失約 %@。

# zfs_pros
source: Checksums detect and repair silent corruption Snapshots and replication are built in RAID-Z2 and Z3 protect large pools well
de: Prüfsummen erkennen und reparieren unbemerkte Datenfehler Snapshots und Replikation sind integriert RAID-Z2 und Z3 schützen große Pools gut
es: Las sumas de verificación detectan y reparan la corrupción silenciosa Instantáneas y replicación integradas RAID-Z2 y Z3 protegen bien los pools grandes
fr: Les sommes de contrôle détectent et réparent la corruption silencieuse Instantanés et réplication intégrés Les RAID-Z2 et Z3 protègent bien les grands pools
it: I checksum rilevano e riparano la corruzione silenziosa Snapshot e replica integrati RAID-Z2 e Z3 proteggono bene i pool di grandi dimensioni
ja: チェックサムがサイレントな破損を検出して修復 スナップショットとレプリケーションを標準搭載 RAID-Z2とZ3は大規模プールをしっかり保護
ko: 체크섬으로 눈에 띄지 않는 손상을 감지하고 복구 스냅샷 및 복제 기본 제공 RAID-Z2 및 Z3은 대규모 풀을 효과적으로 보호
pt_br: Somas de verificação detectam e reparam corrupção silenciosa Snapshots e replicação integrados O RAID-Z2 e o Z3 protegem bem pools grandes
zh_hans: 校验和可检测并修复静默损坏 内置快照和复制功能 RAID-Z2 和 Z3 能很好地保护大型存储池
zh_hant: 總和檢查碼可偵測並修復無聲損毀 內建快照與複寫功能 RAID-Z2 和 Z3 能妥善保護大型儲存池

# zfs_reported_note
source: ≈ %@ as ZFS reports it (estimate)
de: ≈ %@, wie ZFS es anzeigt (Schätzung)
es: ≈ %@ según lo muestra ZFS (estimación)
fr: ≈ %@ tel qu’affiché par ZFS (estimation)
it: ≈ %@ come lo mostra ZFS (stima)
ja: ZFSでの表示は約 %@（推定）
ko: ≈ %@(ZFS 표시 기준 추정치)
pt_br: ≈ %@ como o ZFS informa (estimativa)
zh_hans: ZFS 显示约为 %@（估算）
zh_hant: ZFS 顯示約為 %@（估計值）

# zfs_use_cases
source: TrueNAS, Proxmox and other ZFS servers Photo, document and backup archives Pools where data integrity matters most
de: TrueNAS, Proxmox und andere ZFS-Server Foto-, Dokument- und Backup-Archive Pools, bei denen Datenintegrität am wichtigsten ist
es: TrueNAS, Proxmox y otros servidores ZFS Archivos de fotos, documentos y backups Pools en los que la integridad de los datos es lo más importante
fr: TrueNAS, Proxmox et autres serveurs ZFS Archives de photos, de documents et de sauvegardes Pools où l’intégrité des données prime
it: TrueNAS, Proxmox e altri server ZFS Archivi di foto, documenti e backup Pool in cui l’integrità dei dati conta più di tutto
ja: TrueNAS、ProxmoxなどのZFSサーバー 写真、文書、バックアップのアーカイブ データの整合性を最も重視するプール
ko: TrueNAS, Proxmox 및 기타 ZFS 서버 사진, 문서 및 백업 아카이브 데이터 무결성이 가장 중요한 풀
pt_br: TrueNAS, Proxmox e outros servidores ZFS Arquivos de fotos, documentos e backups Pools em que a integridade dos dados é o mais importante
zh_hans: TrueNAS、Proxmox 及其他 ZFS 服务器 照片、文档和备份归档 最重视数据完整性的存储池
zh_hant: TrueNAS、Proxmox 及其他 ZFS 伺服器 照片、文件與備份封存 最重視資料完整性的儲存池

# nas_setup
source: Setup
es: Configuración
fr: Configuration
it: Configurazione
ja: 構成
ko: 구성
pt_br: Configuração
zh_hans: 配置
zh_hant: 配置

# nas_system
source: System
es: Sistema
fr: Système
it: Sistema
ja: システム
ko: 시스템
pt_br: Sistema
zh_hans: 系统
zh_hant: 系統

# nas_zfs_level
source: RAID-Z Level
es: Nivel RAID-Z
fr: Niveau RAID-Z
it: Livello RAID-Z
ja: RAID-Zレベル
ko: RAID-Z 레벨
pt_br: Nível RAID-Z
zh_hans: RAID-Z 级别
zh_hant: RAID-Z 等級

source: RAID Level
es: Nivel RAID
fr: Niveau RAID
it: Livello RAID
ja: RAIDレベル
ko: RAID 레벨
pt_br: Nível RAID
zh_hans: RAID 级别
zh_hant: RAID 等級
